[
	{
		"title": "Small Office Operations Platform",
		"exerpt": "Full-Stack Web Development",
		"content": "Developed a web application platform, Small Office Operations Platform(SOOP), as a full-stack web developer with Javascript AngularJS framework and Ruby on Rails on AWS Opswork in a fast-pace environment. SOOP is a business manage platform includes features such as the ability to search and to track potential government contracts, providing insights of bidding competitors, and help business owners to their day to day operation. I was responsible for enhancing existed modules and building new features for the platform with compact and extensible code."
	}, {
		"title": "House+ Automated Valuation Platform",
		"exerpt": "Features, Data Scraping",
		"content": "House+ is a machine learning based automated valuation model that aims to provide accurate real estate appraisals in Taiwan with respect to location and condition. I developed a data scraper with Python, Selenium. and PhatomJS to collect trading information from major real estate agencies as training data for our machine learning model. Built Mortgage Calculator with Javascript to provide detailed information of the cash flow and to deliver recommended mortgage package from the major banks in Taiwan. This featured helped the borrowers evaluate their abilities to pay back and chose the best loan for them."
	}, {
		"title": "Two-Dimensional Mesh Generator for Free-drawn Arbitrary Geometry on C++",
		"exerpt": "Academic Project",
		"content": "Developed C++ code to generate mesh for convex shape. Applied object-oriented programming for free-draw, shape check, mesh, and user interface sections. Implemented dynamic memory allocation to improve the computation time displayed the result with openGL."
	}, {
		"title": "Bidding System and Graphic User Interface (GUI) Design on Python ",
		"exerpt": "Academic Project",
		"content": "Developed object-oriented programming Python code for an auction system. Established bidding budget and time limit checking mechanisms for auction operation. Designed the GUI with Tkinter to display and receive essential auction information."
	}, {
		"title": "Airfoil Simulation for NACA0012 on Matlab and Ansys Result Comparison ",
		"exerpt": "Academic Project",
		"content": "Developed Matlab code for airfoil simulation. Applied finite difference, Gauss Seidel, and flagging method on Cartesian grid to solve the partial differential equations for numerical approximation of velocity and pressure of the airfoil around NACA0012. Compared Ansys simulation to check the validity of the applied methods"
	}
]
